# YOLOv9 with ShuffleNet Backbone
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors: 3

backbone:
  [
   [-1, 1, conv_bn_relu_maxpool, [3]],       # 0-P1/4
   [-1, 1, InvertedResidual, [48, 2]],       # 1-P2/8
   [-1, 3, InvertedResidual, [48, 1]],       # 2
   [-1, 1, InvertedResidual, [64, 2]],       # 3-P3/16
   [-1, 7, InvertedResidual, [64, 1]],       # 4
   [-1, 1, InvertedResidual, [96, 2]],       # 5-P4/32
   [-1, 3, InvertedResidual, [96, 1]],       # 6
   [-1, 1, InvertedResidual, [128, 1]],      # 7-P5/32
  ]

head:
  [
   [-1, 1, SPPELAN, [128, 128]],             # 8
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 9
   [[-1, 5], 1, Concat, [1]],                # 10 cat backbone P4
   [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]],   # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 12
   [[-1, 3], 1, Concat, [1]],                # 13 cat backbone P3
   [-1, 1, RepNCSPELAN4, [64, 64, 32, 3]],   # 14
   [-1, 1, AConv, [64]],                     # 15
   [[-1, 11], 1, Concat, [1]],               # 16 cat head P4
   [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]],   # 17 (P4/16-medium)
   [-1, 1, AConv, [64]],                     # 18
   [[-1, 8], 1, Concat, [1]],                # 19 cat head P5
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]], # 20 (P5/32-large)
   
   [7, 1, SPPELAN, [128, 128]],              # 21
   [-1, 1, nn.Upsample, [None, 4, 'nearest']], # 22
   [[-1, 5], 1, Concat, [1]],                # 23 cat backbone P4
   [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]],   # 24
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 25
   [[-1, 3], 1, Concat, [1]],                # 26 cat backbone P3
   [-1, 1, RepNCSPELAN4, [64, 64, 32, 3]],   # 27
   [[27, 24, 21, 14, 17, 20], 1, DualDDetect, [nc]],  # 28 Detect(P3, P4, P5)
  ]
