# YOLOv9 with ShuffleNet Backbone
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors: 3

backbone:
  [
   [-1, 1, conv_bn_relu_maxpool, [3]],       # 0-P1/4
   [-1, 1, ShuffleNetV2_InvertedResidual, [32, 2]],       # 1-P2/8
   [-1, 3, ShuffleNetV2_InvertedResidual, [32, 1]],       # 2
   [-1, 1, ShuffleNetV2_InvertedResidual, [64, 2]],       # 3-P3/16
   [-1, 7, ShuffleNetV2_InvertedResidual, [64, 1]],       # 4
   [-1, 1, ShuffleNetV2_InvertedResidual, [128, 2]],       # 5-P4/32
   [-1, 3, ShuffleNetV2_InvertedResidual, [128, 1]],       # 6
  ]

head:
  [
   [-1, 1, SPPELAN, [128, 128]],             # 7
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 8
   [[-1, 4], 1, Concat, [1]],                # 9 cat backbone P4
   [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]],   # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 2], 1, Concat, [1]],                # 12 cat backbone P3
   [-1, 1, RepNCSPELAN4, [64, 64, 32, 3]],   # 13
   [-1, 1, AConv, [48]],                     # 14
   [[-1, 10], 1, Concat, [1]],               # 15 cat head P4
   [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]],   # 16 (P4/16-medium)
   [-1, 1, AConv, [64]],                     # 17
   [[-1, 7], 1, Concat, [1]],                # 18 cat head P5
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]], # 19 (P5/32-large)
   
   [7, 1, SPPELAN, [128, 128]],              # 20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 21
   [[-1, 4], 1, Concat, [1]],                # 22 cat backbone P4
   [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]],   # 23
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 24
   [[-1, 2], 1, Concat, [1]],                # 25 cat backbone P3
   [-1, 1, RepNCSPELAN4, [64, 64, 32, 3]],   # 26
   [[26, 23, 20, 13, 15, 18], 1, DualDDetect, [nc]],  # 27 Detect(P3, P4, P5)
  ]
